app/controllers/needs_controller.rb

    def index
        needs = Need.all
---
SELECT "needs".* FROM "needs"

    def show
        need = Need.find(params[:id])
---
SELECT "needs".* FROM "needs" WHERE "needs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create

        need = Need.create(notes: params[:notes], medication: params[:medication], exercise: params[:exercise], diet: params[:diet], pet_id: params[:pet_id])
---
INSERT INTO "needs" ("notes", "medication", "exercise", "diet", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["notes", "flopsie"], ["medication", 0], ["exercise", 0], ["diet", 0], ["pet_id", 2], ["created_at", "2021-01-27 07:45:43.830124"], ["updated_at", "2021-01-27 07:45:43.830124"]]

    def destroy
        need = Need.find(params[:id]).destroy
---
DELETE FROM "needs" WHERE "needs"."id" = ?  [["id", 152]]
SELECT "needs".* FROM "needs" WHERE "needs"."id" = ? LIMIT ?  [["id", 152], ["LIMIT", 1]]