app/controllers/pets_controller.rb

    def index
        pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def update
        pet = Pet.find(params[:id])
        pet.update(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "medication" = ?, "exercise" = ?, "diet" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["medication", "asd"], ["exercise", "asd"], ["diet", "asd"], ["updated_at", "2021-01-28 05:37:27.356262"], ["id", 1]]